relativty/Relativty/Relativty_Firmware/hid/Relativty_board/boards.txt

relativty_dbg.name=Relativty (Programming Port)
relativty_dbg.vid.0=0x1209
relativty_dbg.pid.0=0x000A
relativty_dbg.vid.1=0x2A03
relativty_dbg.pid.1=0x000A
relativty_dbg.upload.tool=bossac
relativty_dbg.upload.protocol=sam-ba
relativty_dbg.upload.maximum_size=524288
relativty_dbg.upload.use_1200bps_touch=true
relativty_dbg.upload.wait_for_upload_port=false
relativty_dbg.upload.native_usb=false
relativty_dbg.build.mcu=cortex-m3
relativty_dbg.build.f_cpu=84000000L
relativty_dbg.build.usb_manufacturer="Relativty"
relativty_dbg.build.usb_product="Relativty"
relativty_dbg.build.board=SAM_DUE
relativty_dbg.build.core=arduino
relativty_dbg.build.extra_flags=-D__SAM3X8E__ -mthumb {build.usb_flags}
relativty_dbg.build.ldscript=linker_scripts/gcc/flash.ld
relativty_dbg.build.variant=relativty
relativty_dbg.build.variant_system_lib=libsam_sam3x8e_gcc_rel.a
relativty_dbg.build.vid=0x1209
relativty_dbg.build.pid=0x000A

relativty.name=Relativty (Native USB Port)
relativty.vid.0=0x1209
relativty.pid.0=0x0009
relativty.vid.1=0x2A03
relativty.pid.1=0x0009
relativty.upload.tool=bossac
relativty.upload.protocol=sam-ba
relativty.upload.maximum_size=524288
relativty.upload.use_1200bps_touch=true
relativty.upload.wait_for_upload_port=true
relativty.upload.native_usb=true
relativty.build.mcu=cortex-m3
relativty.build.f_cpu=84000000L
relativty.build.usb_manufacturer="Relativty"
relativty.build.usb_product="Relativty"
relativty.build.board=SAM_DUE
relativty.build.core=arduino
relativty.build.extra_flags=-D__SAM3X8E__ -mthumb {build.usb_flags}
relativty.build.ldscript=linker_scripts/gcc/flash.ld
relativty.build.variant=relativty
relativty.build.variant_system_lib=libsam_sam3x8e_gcc_rel.a
relativty.build.vid=0x1209
relativty.build.pid=0x0009